set_property PACKAGE_PIN U25 [get_ports OSC_IN]
set_property CFGBVS VCCO [current_design]
set_property CONFIG_VOLTAGE 3.3 [current_design]

set_property PACKAGE_PIN D23 [get_ports {ADC_CLK[0]}]
set_property PACKAGE_PIN B25 [get_ports {ADC_CLK[1]}]
set_property PACKAGE_PIN B24 [get_ports {ADC_CLK[2]}]
set_property PACKAGE_PIN A13 [get_ports {ADC_CLK[3]}]
set_property PACKAGE_PIN G26 [get_ports {ADC_SET[0]}]
set_property PACKAGE_PIN G24 [get_ports {ADC_SET[1]}]
set_property PACKAGE_PIN C18 [get_ports {ADC_SET[2]}]
set_property PACKAGE_PIN A18 [get_ports {ADC_SET[3]}]

set_property PACKAGE_PIN J25 [get_ports {ADC_A[0]}]
set_property PACKAGE_PIN J26 [get_ports {ADC_A[1]}]
set_property PACKAGE_PIN K25 [get_ports {ADC_A[2]}]
set_property PACKAGE_PIN K26 [get_ports {ADC_A[3]}]
set_property PACKAGE_PIN L25 [get_ports {ADC_A[4]}]
set_property PACKAGE_PIN M25 [get_ports {ADC_A[5]}]
set_property PACKAGE_PIN F24 [get_ports {ADC_A[6]}]
set_property PACKAGE_PIN G22 [get_ports {ADC_A[7]}]
set_property PACKAGE_PIN E23 [get_ports {ADC_A[8]}]
set_property PACKAGE_PIN F23 [get_ports {ADC_A[9]}]

set_property PACKAGE_PIN H26 [get_ports {ADC_B[0]}]
set_property PACKAGE_PIN G25 [get_ports {ADC_B[1]}]
set_property PACKAGE_PIN F25 [get_ports {ADC_B[2]}]
set_property PACKAGE_PIN E26 [get_ports {ADC_B[3]}]
set_property PACKAGE_PIN E25 [get_ports {ADC_B[4]}]
set_property PACKAGE_PIN D26 [get_ports {ADC_B[5]}]
set_property PACKAGE_PIN D25 [get_ports {ADC_B[6]}]
set_property PACKAGE_PIN C26 [get_ports {ADC_B[7]}]
set_property PACKAGE_PIN D24 [get_ports {ADC_B[8]}]
set_property PACKAGE_PIN B26 [get_ports {ADC_B[9]}]

set_property PACKAGE_PIN A20 [get_ports {ADC_C[0]}]
set_property PACKAGE_PIN B20 [get_ports {ADC_C[1]}]
set_property PACKAGE_PIN B21 [get_ports {ADC_C[2]}]
set_property PACKAGE_PIN A22 [get_ports {ADC_C[3]}]
set_property PACKAGE_PIN C21 [get_ports {ADC_C[4]}]
set_property PACKAGE_PIN A23 [get_ports {ADC_C[5]}]
set_property PACKAGE_PIN B22 [get_ports {ADC_C[6]}]
set_property PACKAGE_PIN A24 [get_ports {ADC_C[7]}]
set_property PACKAGE_PIN C23 [get_ports {ADC_C[8]}]
set_property PACKAGE_PIN A25 [get_ports {ADC_C[9]}]

set_property PACKAGE_PIN B19 [get_ports {ADC_D[0]}]
set_property PACKAGE_PIN A19 [get_ports {ADC_D[1]}]
set_property PACKAGE_PIN B17 [get_ports {ADC_D[2]}]
set_property PACKAGE_PIN A17 [get_ports {ADC_D[3]}]
set_property PACKAGE_PIN C16 [get_ports {ADC_D[4]}]
set_property PACKAGE_PIN B16 [get_ports {ADC_D[5]}]
set_property PACKAGE_PIN A15 [get_ports {ADC_D[6]}]
set_property PACKAGE_PIN B15 [get_ports {ADC_D[7]}]
set_property PACKAGE_PIN A14 [get_ports {ADC_D[8]}]
set_property PACKAGE_PIN B14 [get_ports {ADC_D[9]}]

set_property PACKAGE_PIN N26 [get_ports ADC_SCLK]
set_property PACKAGE_PIN M26 [get_ports ADC_SYNC]
set_property PACKAGE_PIN P26 [get_ports ADC_SDIN]
set_property PACKAGE_PIN AE1 [get_ports SCLK]
set_property PACKAGE_PIN AF3 [get_ports SYNC]
set_property PACKAGE_PIN AD1 [get_ports SDIN]

set_property PACKAGE_PIN AE12 [get_ports ASIC_POWER_OUT]
set_property PACKAGE_PIN AF4 [get_ports CHIP_CK]
set_property PACKAGE_PIN AF14 [get_ports CHIP_RB]
set_property PACKAGE_PIN AD14 [get_ports CHIP_WR]
set_property PACKAGE_PIN AE13 [get_ports CHIP_SD]
#set_property PACKAGE_PIN AF13 [get_ports ASIC_XDO_IN]

set_property PACKAGE_PIN B12 [get_ports {XDP[0]}]
set_property PACKAGE_PIN A12 [get_ports {XDP[1]}]
set_property PACKAGE_PIN C12 [get_ports {XDP[2]}]
set_property PACKAGE_PIN B11 [get_ports {XDP[3]}]
set_property PACKAGE_PIN A10 [get_ports {XDP[4]}]
set_property PACKAGE_PIN B9 [get_ports {XDP[5]}]
set_property PACKAGE_PIN A9 [get_ports {XDP[6]}]
set_property PACKAGE_PIN C8 [get_ports {XDP[7]}]
set_property PACKAGE_PIN A8 [get_ports {XDP[8]}]
set_property PACKAGE_PIN A7 [get_ports {XDP[9]}]
set_property PACKAGE_PIN B6 [get_ports {XDP[10]}]
set_property PACKAGE_PIN C6 [get_ports {XDP[11]}]
set_property PACKAGE_PIN A5 [get_ports {XDP[12]}]
set_property PACKAGE_PIN B5 [get_ports {XDP[13]}]
set_property PACKAGE_PIN A4 [get_ports {XDP[14]}]
set_property PACKAGE_PIN A3 [get_ports {XDP[15]}]
set_property PACKAGE_PIN C11 [get_ports {XDP[16]}]
set_property PACKAGE_PIN B10 [get_ports {XDP[17]}]
set_property PACKAGE_PIN C9 [get_ports {XDP[18]}]
set_property PACKAGE_PIN B7 [get_ports {XDP[19]}]
set_property PACKAGE_PIN C7 [get_ports {XDP[20]}]
set_property PACKAGE_PIN D4 [get_ports {XDP[21]}]
set_property PACKAGE_PIN B4 [get_ports {XDP[22]}]
set_property PACKAGE_PIN C4 [get_ports {XDP[23]}]
set_property PACKAGE_PIN C3 [get_ports {XDP[24]}]
set_property PACKAGE_PIN A2 [get_ports {XDP[25]}]
set_property PACKAGE_PIN B2 [get_ports {XDP[26]}]
set_property PACKAGE_PIN B1 [get_ports {XDP[27]}]
set_property PACKAGE_PIN C2 [get_ports {XDP[28]}]
set_property PACKAGE_PIN C1 [get_ports {XDP[29]}]
set_property PACKAGE_PIN D3 [get_ports {XDP[30]}]
set_property PACKAGE_PIN D1 [get_ports {XDP[31]}]
set_property PACKAGE_PIN E2 [get_ports {XDP[32]}]
set_property PACKAGE_PIN E1 [get_ports {XDP[33]}]
set_property PACKAGE_PIN F3 [get_ports {XDP[34]}]
set_property PACKAGE_PIN G2 [get_ports {XDP[35]}]
set_property PACKAGE_PIN G1 [get_ports {XDP[36]}]
set_property PACKAGE_PIN H2 [get_ports {XDP[37]}]
set_property PACKAGE_PIN H1 [get_ports {XDP[38]}]
set_property PACKAGE_PIN J1 [get_ports {XDP[39]}]
set_property PACKAGE_PIN K2 [get_ports {XDP[40]}]
set_property PACKAGE_PIN K1 [get_ports {XDP[41]}]
set_property PACKAGE_PIN L2 [get_ports {XDP[42]}]
set_property PACKAGE_PIN M2 [get_ports {XDP[43]}]
set_property PACKAGE_PIN M1 [get_ports {XDP[44]}]
set_property PACKAGE_PIN N2 [get_ports {XDP[45]}]
set_property PACKAGE_PIN N1 [get_ports {XDP[46]}]
set_property PACKAGE_PIN N3 [get_ports {XDP[47]}]
set_property PACKAGE_PIN E3 [get_ports {XDP[48]}]
set_property PACKAGE_PIN F2 [get_ports {XDP[49]}]
set_property PACKAGE_PIN F4 [get_ports {XDP[50]}]
set_property PACKAGE_PIN G5 [get_ports {XDP[51]}]
set_property PACKAGE_PIN G4 [get_ports {XDP[52]}]
set_property PACKAGE_PIN H3 [get_ports {XDP[53]}]
set_property PACKAGE_PIN H4 [get_ports {XDP[54]}]
set_property PACKAGE_PIN J3 [get_ports {XDP[55]}]
set_property PACKAGE_PIN J4 [get_ports {XDP[56]}]
set_property PACKAGE_PIN K3 [get_ports {XDP[57]}]
set_property PACKAGE_PIN K5 [get_ports {XDP[58]}]
set_property PACKAGE_PIN L4 [get_ports {XDP[59]}]
set_property PACKAGE_PIN L3 [get_ports {XDP[60]}]
set_property PACKAGE_PIN M5 [get_ports {XDP[61]}]
set_property PACKAGE_PIN M4 [get_ports {XDP[62]}]
set_property PACKAGE_PIN N4 [get_ports {XDP[63]}]
set_property PACKAGE_PIN P1 [get_ports {XDP[64]}]
set_property PACKAGE_PIN P3 [get_ports {XDP[65]}]
set_property PACKAGE_PIN R1 [get_ports {XDP[66]}]
set_property PACKAGE_PIN R2 [get_ports {XDP[67]}]
set_property PACKAGE_PIN U1 [get_ports {XDP[68]}]
set_property PACKAGE_PIN U2 [get_ports {XDP[69]}]
set_property PACKAGE_PIN V1 [get_ports {XDP[70]}]
set_property PACKAGE_PIN V2 [get_ports {XDP[71]}]
set_property PACKAGE_PIN W1 [get_ports {XDP[72]}]
set_property PACKAGE_PIN Y1 [get_ports {XDP[73]}]
set_property PACKAGE_PIN Y2 [get_ports {XDP[74]}]
set_property PACKAGE_PIN AA2 [get_ports {XDP[75]}]
set_property PACKAGE_PIN AB1 [get_ports {XDP[76]}]
set_property PACKAGE_PIN AB2 [get_ports {XDP[77]}]
set_property PACKAGE_PIN AC1 [get_ports {XDP[78]}]
set_property PACKAGE_PIN AB4 [get_ports {XDP[79]}]
set_property PACKAGE_PIN P4 [get_ports {XDP[80]}]
set_property PACKAGE_PIN P5 [get_ports {XDP[81]}]
set_property PACKAGE_PIN R3 [get_ports {XDP[82]}]
set_property PACKAGE_PIN T2 [get_ports {XDP[83]}]
set_property PACKAGE_PIN T3 [get_ports {XDP[84]}]
set_property PACKAGE_PIN T4 [get_ports {XDP[85]}]
set_property PACKAGE_PIN U4 [get_ports {XDP[86]}]
set_property PACKAGE_PIN U5 [get_ports {XDP[87]}]
set_property PACKAGE_PIN V3 [get_ports {XDP[88]}]
set_property PACKAGE_PIN V4 [get_ports {XDP[89]}]
set_property PACKAGE_PIN W3 [get_ports {XDP[90]}]
set_property PACKAGE_PIN W4 [get_ports {XDP[91]}]
set_property PACKAGE_PIN Y3 [get_ports {XDP[92]}]
set_property PACKAGE_PIN Y5 [get_ports {XDP[93]}]
set_property PACKAGE_PIN AA3 [get_ports {XDP[94]}]
set_property PACKAGE_PIN AA4 [get_ports {XDP[95]}]
set_property PACKAGE_PIN AE2 [get_ports {XDP[96]}]
set_property PACKAGE_PIN AF2 [get_ports {XDP[97]}]
set_property PACKAGE_PIN AD3 [get_ports {XDP[98]}]
set_property PACKAGE_PIN AE3 [get_ports {XDP[99]}]
set_property PACKAGE_PIN AD4 [get_ports {XDP[100]}]
set_property PACKAGE_PIN AE5 [get_ports {XDP[101]}]
set_property PACKAGE_PIN AF5 [get_ports {XDP[102]}]
set_property PACKAGE_PIN AE6 [get_ports {XDP[103]}]
set_property PACKAGE_PIN AE7 [get_ports {XDP[104]}]
set_property PACKAGE_PIN AF7 [get_ports {XDP[105]}]
set_property PACKAGE_PIN AE8 [get_ports {XDP[106]}]
set_property PACKAGE_PIN AF8 [get_ports {XDP[107]}]
set_property PACKAGE_PIN AF9 [get_ports {XDP[108]}]
set_property PACKAGE_PIN AF10 [get_ports {XDP[109]}]
set_property PACKAGE_PIN AE11 [get_ports {XDP[110]}]
set_property PACKAGE_PIN AF12 [get_ports {XDP[111]}]
set_property PACKAGE_PIN AC2 [get_ports {XDP[112]}]
set_property PACKAGE_PIN AC3 [get_ports {XDP[113]}]
set_property PACKAGE_PIN AC4 [get_ports {XDP[114]}]
set_property PACKAGE_PIN AD5 [get_ports {XDP[115]}]
set_property PACKAGE_PIN AC6 [get_ports {XDP[116]}]
set_property PACKAGE_PIN AD6 [get_ports {XDP[117]}]
set_property PACKAGE_PIN AB7 [get_ports {XDP[118]}]
set_property PACKAGE_PIN AC7 [get_ports {XDP[119]}]
set_property PACKAGE_PIN AD11 [get_ports {XDP[120]}]
set_property PACKAGE_PIN AC8 [get_ports {XDP[121]}]
set_property PACKAGE_PIN AD8 [get_ports {XDP[122]}]
set_property PACKAGE_PIN AC9 [get_ports {XDP[123]}]
set_property PACKAGE_PIN AD9 [get_ports {XDP[124]}]
set_property PACKAGE_PIN AC11 [get_ports {XDP[125]}]
set_property PACKAGE_PIN AD10 [get_ports {XDP[126]}]
set_property PACKAGE_PIN AE10 [get_ports {XDP[127]}]

set_property PACKAGE_PIN AE16 [get_ports EEPROM_SK_OUT]
set_property PACKAGE_PIN AE17 [get_ports EEPROM_CS_OUT]
set_property PACKAGE_PIN AF15 [get_ports EEPROM_DI_OUT]
set_property PACKAGE_PIN AE15 [get_ports EEPROM_DO_IN]

set_property PACKAGE_PIN AF17 [get_ports ETH_nRST_OUT]
set_property PACKAGE_PIN AD18 [get_ports ETH_GTXCLK_OUT]
set_property PACKAGE_PIN AE20 [get_ports ETH_TX_CLK_IN]
set_property PACKAGE_PIN AD20 [get_ports ETH_TX_EN_OUT]
set_property PACKAGE_PIN AF20 [get_ports ETH_TX_ER_OUT]
set_property PACKAGE_PIN AE21 [get_ports {ETH_TXD_OUT[0]}]
set_property PACKAGE_PIN AF22 [get_ports {ETH_TXD_OUT[1]}]
set_property PACKAGE_PIN AE22 [get_ports {ETH_TXD_OUT[2]}]
set_property PACKAGE_PIN AF23 [get_ports {ETH_TXD_OUT[3]}]
set_property PACKAGE_PIN AE23 [get_ports {ETH_TXD_OUT[4]}]
set_property PACKAGE_PIN AF24 [get_ports {ETH_TXD_OUT[5]}]
set_property PACKAGE_PIN AF25 [get_ports {ETH_TXD_OUT[6]}]
set_property PACKAGE_PIN AE26 [get_ports {ETH_TXD_OUT[7]}]
set_property PACKAGE_PIN AD21 [get_ports ETH_RX_CLK_IN]
set_property PACKAGE_PIN AD19 [get_ports ETH_RX_DV_IN]
set_property PACKAGE_PIN AF19 [get_ports ETH_RX_ER_IN]
set_property PACKAGE_PIN AB25 [get_ports {ETH_RXD_IN[0]}]
set_property PACKAGE_PIN AC26 [get_ports {ETH_RXD_IN[1]}]
set_property PACKAGE_PIN AC24 [get_ports {ETH_RXD_IN[2]}]
set_property PACKAGE_PIN AD26 [get_ports {ETH_RXD_IN[3]}]
set_property PACKAGE_PIN AD25 [get_ports {ETH_RXD_IN[4]}]
set_property PACKAGE_PIN AE25 [get_ports {ETH_RXD_IN[5]}]
set_property PACKAGE_PIN AD24 [get_ports {ETH_RXD_IN[6]}]
set_property PACKAGE_PIN AD23 [get_ports {ETH_RXD_IN[7]}]
set_property PACKAGE_PIN AD15 [get_ports ETH_RX_COL_IN]
set_property PACKAGE_PIN AD16 [get_ports ETH_RX_CRS_IN]
set_property PACKAGE_PIN AF18 [get_ports ETH_MDC_OUT]
set_property PACKAGE_PIN AE18 [get_ports ETH_MDIO_IO]
set_property PACKAGE_PIN AB26 [get_ports ETH_HPD_OUT]
set_property PACKAGE_PIN AB24 [get_ports ETH_IRQ_IN]
set_property IOSTANDARD LVCMOS33 [get_ports ETH_IRQ_IN]

set_property PACKAGE_PIN T22 [get_ports {TRG_IN[0]}]
set_property PACKAGE_PIN V23 [get_ports {TRG_IN[1]}]
set_property PACKAGE_PIN V24 [get_ports {TRG_IN[2]}]
set_property PACKAGE_PIN W24 [get_ports {TRG_IN[3]}]
set_property PACKAGE_PIN V26 [get_ports {TRG_IN[4]}]
# set_property PACKAGE_PIN W25  [get_ports {TRG_IN[5]}]
# set_property PACKAGE_PIN W26  [get_ports {TRG_IN[6]}]
# set_property PACKAGE_PIN Y25  [get_ports {TRG_IN[7]}]
set_property PACKAGE_PIN T24 [get_ports {TRG_OUT[0]}]
set_property PACKAGE_PIN P24 [get_ports {TRG_OUT[1]}]
set_property PACKAGE_PIN T23 [get_ports {TRG_OUT[2]}]
set_property PACKAGE_PIN P25 [get_ports {TRG_OUT[3]}]
set_property PACKAGE_PIN R25 [get_ports {TRG_OUT[4]}]
set_property PACKAGE_PIN T25 [get_ports {TRG_OUT[5]}]
set_property PACKAGE_PIN R26 [get_ports {TRG_OUT[6]}]
set_property PACKAGE_PIN U26 [get_ports {TRG_OUT[7]}]

set_property PACKAGE_PIN Y26 [get_ports {LED_OUT[0]}]
set_property PACKAGE_PIN Y23 [get_ports {LED_OUT[1]}]
set_property PACKAGE_PIN AA24 [get_ports {LED_OUT[2]}]
set_property PACKAGE_PIN AA25 [get_ports {LED_OUT[3]}]
set_property PACKAGE_PIN M24 [get_ports {DIP_SW_IN[0]}]
set_property PACKAGE_PIN L23 [get_ports {DIP_SW_IN[1]}]
set_property PACKAGE_PIN L24 [get_ports {DIP_SW_IN[2]}]
set_property PACKAGE_PIN K23 [get_ports {DIP_SW_IN[3]}]
set_property PACKAGE_PIN J24 [get_ports {DIP_SW_IN[4]}]
set_property PACKAGE_PIN J23 [get_ports {DIP_SW_IN[5]}]
set_property PACKAGE_PIN H24 [get_ports {DIP_SW_IN[6]}]
set_property PACKAGE_PIN H23 [get_ports {DIP_SW_IN[7]}]

create_clock -period 20.000 -name OSC_IN -waveform {0.000 10.000} [get_ports OSC_IN]
#create_clock -period 20.000 -name ExtClk -waveform {0.000 10.000} [get_ports {TRG_IN[0]}]
#set_false_path -from [get_clocks OSC_IN] -to [get_clocks ExtClk]
#set_false_path -from [get_clocks ExtClk] -to [get_clocks OSC_IN]
create_clock -period 40.000 -name ETH_TX_CLK_IN -waveform {0.000 20.000} [get_ports ETH_TX_CLK_IN]
create_clock -period 8.000 -name ETH_RX_CLK_IN -waveform {0.000 4.000} [get_ports ETH_RX_CLK_IN]

set_max_delay -datapath_only -from [get_pins {rx_cnt_reg[6]/C}] -to [get_pins gmii_1000M_reg/D] 5.000
set_false_path -from [get_pins cnt_rst_reg/C] -to [get_pins rx_cnt_reg*/CLR]
set_false_path -from [get_pins gmii_1000M_reg/C]
set_false_path -through [get_nets SiTCP_Reset]


#### GMII Rx ####
set_property IOB FALSE [get_cells -hierarchical -filter {name =~ */GMII_RXCNT/IOB_RD*}]
set_property IOB FALSE [get_cells -hierarchical -filter {name =~ */GMII_RXCNT/IOB_RDV}]
set_property IOB FALSE [get_cells -hierarchical -filter {name =~ */GMII_RXCNT/IOB_RERR}]

set_input_delay -clock [get_clocks ETH_RX_CLK_IN] -min 0.000 [get_ports ETH_RXD_IN*]
set_input_delay -clock [get_clocks ETH_RX_CLK_IN] -min 0.000 [get_ports ETH_RX_ER_IN]
set_input_delay -clock [get_clocks ETH_RX_CLK_IN] -min 0.000 [get_ports ETH_RX_DV_IN]
set_input_delay -clock [get_clocks ETH_RX_CLK_IN] -max 6.000 [get_ports ETH_RXD_IN*]
set_input_delay -clock [get_clocks ETH_RX_CLK_IN] -max 6.000 [get_ports ETH_RX_ER_IN]
set_input_delay -clock [get_clocks ETH_RX_CLK_IN] -max 6.000 [get_ports ETH_RX_DV_IN]


#### GMII Tx ####
set_property IOB TRUE [get_cells -hierarchical -filter {name =~ */GMII_TXCNT/IOB_TD*}]
set_property IOB TRUE [get_cells -hierarchical -filter {name =~ */GMII_TXCNT/IOB_TEN}]

create_generated_clock -source [get_pins GMIIMUX/I1] -divide_by 1 -invert [get_ports ETH_GTXCLK_OUT]
set_clock_groups -asynchronous -group ETH_TX_CLK_IN -group {clk_125M ETH_GTXCLK_OUT}

set_output_delay -clock ETH_TX_CLK_IN -max 15.000 [get_ports ETH_TXD_OUT*]
set_output_delay -clock ETH_TX_CLK_IN -min 0.000 [get_ports ETH_TXD_OUT*]
set_output_delay -clock ETH_TX_CLK_IN -max 15.000 [get_ports ETH_TX_EN_OUT]
set_output_delay -clock ETH_TX_CLK_IN -min 0.000 [get_ports ETH_TX_EN_OUT]
set_output_delay -clock ETH_TX_CLK_IN -max 15.000 [get_ports ETH_TX_ER_OUT]
set_output_delay -clock ETH_TX_CLK_IN -min 0.000 [get_ports ETH_TX_ER_OUT]

set_output_delay -clock ETH_GTXCLK_OUT -max -add_delay 2.500 [get_ports ETH_TXD_OUT*]
set_output_delay -clock ETH_GTXCLK_OUT -min -add_delay -0.500 [get_ports ETH_TXD_OUT*]
set_output_delay -clock ETH_GTXCLK_OUT -max -add_delay 2.500 [get_ports ETH_TX_EN_OUT]
set_output_delay -clock ETH_GTXCLK_OUT -min -add_delay -0.500 [get_ports ETH_TX_EN_OUT]
set_output_delay -clock ETH_GTXCLK_OUT -max -add_delay 2.500 [get_ports ETH_TX_ER_OUT]
set_output_delay -clock ETH_GTXCLK_OUT -min -add_delay -0.500 [get_ports ETH_TX_ER_OUT]

#### MDIO ####
set_max_delay -from [get_ports ETH_MDIO_IO] 10.000
#set_min_delay -from [get_ports ETH_MDIO_IO] 0.000
set_min_delay -from [get_ports ETH_MDIO_IO] -5.000
set_max_delay -datapath_only -from [get_clocks clk_200M] -to [get_ports ETH_MDC_OUT] 10.000
set_max_delay -datapath_only -from [get_clocks clk_200M] -to [get_ports ETH_MDIO_IO] 10.000
set_max_delay -datapath_only -from [get_clocks clk_200M] -to [get_ports ETH_nRST_OUT] 10.000

#### EEPROM ####
set_max_delay -datapath_only -from [get_clocks clk_200M] -to [get_ports EEPROM_SK_OUT] 10.000
set_max_delay -datapath_only -from [get_clocks clk_200M] -to [get_ports EEPROM_CS_OUT] 10.000
set_max_delay -datapath_only -from [get_clocks clk_200M] -to [get_ports EEPROM_DI_OUT] 10.000
set_max_delay -from [get_ports EEPROM_DO_IN] 10.000
#set_min_delay -from [get_ports EEPROM_DO_IN] 0.000
set_min_delay -from [get_ports EEPROM_DO_IN] -5.000

#### LED ####
set_max_delay -datapath_only -from [get_clocks clk_200M] -to [get_ports LED_OUT*] 10.000

#### DIP Switch ####
#set_max_delay -from [get_ports DIP_SW_IN*] 10.000
#set_min_delay -from [get_ports DIP_SW_IN*] 0.000

#### TRIGGER ####
set_input_delay -clock [get_clocks clk_100M] -min 2.000 [get_ports TRG_IN*]
set_input_delay -clock [get_clocks clk_100M] -max 4.000 [get_ports TRG_IN*]
set_output_delay -clock [get_clocks clk_100M] -max -2.000 [get_ports TRG_OUT*]
set_output_delay -clock [get_clocks clk_100M] -min -3.000 [get_ports TRG_OUT*]
set_false_path -from [get_ports {TRG_IN[0]}] -to [get_ports LED_OUT*]

#### ASIC ####
set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports ASIC_POWER_OUT] 10.000
set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports CHIP_CK] 10.000
#set_output_delay -clock [get_clocks clk_100M] -max 4.000 [get_ports CHIP_RB]
#set_output_delay -clock [get_clocks clk_100M] -max 4.000 [get_ports CHIP_WR]
#set_output_delay -clock [get_clocks clk_100M] -max 4.000 [get_ports CHIP_RB]
#set_output_delay -clock [get_clocks clk_100M] -max 4.000 [get_ports CHIP_SD]
#set_output_delay -clock [get_clocks clk_100M] -min 1.000 [get_ports CHIP_RB]
#set_output_delay -clock [get_clocks clk_100M] -min 1.000 [get_ports CHIP_WR]
#set_output_delay -clock [get_clocks clk_100M] -min 1.000 [get_ports CHIP_RB]
#set_output_delay -clock [get_clocks clk_100M] -min 1.000 [get_ports CHIP_SD]
#set_input_delay -clock [get_clocks PLL_200M] -min 2 [get_port ASIC_XDO_IN]
#set_input_delay -clock [get_clocks PLL_200M] -max 4 [get_port ASIC_XDO_IN]
set _xlnx_shared_i0 [get_ports XDP*]
set_input_delay -clock [get_clocks clk_100M] -min 2.000 $_xlnx_shared_i0
set_input_delay -clock [get_clocks clk_100M] -max 4.000 $_xlnx_shared_i0

#### DAC ####
set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports ADC_SCLK] 10.000
create_generated_clock -source [get_pins ADC_BIAS_CLK_FD/C] -divide_by 10 [get_ports ADC_SCLK]
set_output_delay -clock ADC_SCLK -max 4.000 [get_ports ADC_SYNC]
set_output_delay -clock ADC_SCLK -max 4.000 [get_ports ADC_SDIN]
set_output_delay -clock ADC_SCLK -min 1.000 [get_ports ADC_SYNC]
set_output_delay -clock ADC_SCLK -min 1.000 [get_ports ADC_SDIN]

set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports SCLK] 10.000
create_generated_clock -source [get_pins Vth_CLK_FD/C] -divide_by 10 [get_ports SCLK]
set_output_delay -clock SCLK -max 4.000 [get_ports SYNC]
set_output_delay -clock SCLK -max 4.000 [get_ports SDIN]
set_output_delay -clock SCLK -min 1.000 [get_ports SYNC]
set_output_delay -clock SCLK -min 1.000 [get_ports SDIN]

#### ADC ####
set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports {ADC_CLK[0]}] 9.000
#create_generated_clock -source [get_pins CH_A_ADC/CLK_OR/C] -divide_by 4  [get_ports {ADC_CLK[0]}]
#set_input_delay -clock [get_clocks {ADC_CLK[0]}] -min 2.5 [get_ports ADC_A*]
#set_input_delay -clock [get_clocks {ADC_CLK[0]}] -max -8 [get_ports ADC_A*]

set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports {ADC_CLK[1]}] 9.000
#create_generated_clock -source [get_pins CH_B_DC/CLK_OR/C] -divide_by 4  [get_ports {ADC_CLK[1]}]
#set_input_delay -clock [get_clocks DC_B_CLK_OT] -min 2.5 [get_ports ADC_B*]
#set_input_delay -clock [get_clocks {ADC_CLK[1]}] -max -8 [get_ports ADC_B*]

set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports {ADC_CLK[2]}] 9.000
#create_generated_clock -source [get_pins CH_C_ADC/CLK_OR/C] -divide_by 4  [get_ports {ADC_CLK[2]}]
#set_input_delay -clock [get_clocks {ADC_CLK[2]}] -min 2.5 [get_ports ADC_C*]
#set_input_delay -clock [get_clocks {ADC_CLK[2]}] -max -8 [get_ports ADC_C*]

set_max_delay -datapath_only -from [get_clocks clk_100M] -to [get_ports {ADC_CLK[3]}] 9.000
#create_generated_clock -source [get_pins CH_D_ADC/CLK_OR/C] -divide_by 4  [get_ports {ADC_CLK[3]}]
#set_input_delay -clock [get_clocks {ADC_CLK[3]}] -min -2.5 [get_ports ADC_D*]
#set_input_delay -clock [get_clocks {ADC_CLK[3]}] -max -8 [get_ports ADC_D*]

set_false_path -from [get_ports {DIP_SW_IN[*]}]
set_false_path -from [get_ports {TRG_IN[0]}] -to [get_pins Osc_MUX/I1]


set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_A[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_B[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_C[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_SET[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_SET[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_SET[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_SET[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ADC_D[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[127]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[126]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[125]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[124]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[123]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[122]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[121]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[120]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[119]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[118]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[117]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[116]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[115]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[114]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[113]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[112]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[111]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[110]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[109]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[108]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[107]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[106]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[105]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[104]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[103]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[102]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[101]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[100]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[99]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[98]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[97]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[96]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[95]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[94]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[93]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[92]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[91]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[90]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[89]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[88]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[87]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[86]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[85]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[84]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[83]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[82]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[81]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[80]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[79]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[78]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[77]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[76]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[75]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[74]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[73]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[72]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[71]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[70]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[69]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[68]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[67]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[66]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[65]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[64]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[63]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[62]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[61]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[60]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[59]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[58]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[57]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[56]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[55]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[54]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[53]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[52]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[51]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[50]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[49]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[48]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[47]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[46]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[45]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[44]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[43]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[42]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[41]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[40]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[39]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[38]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[37]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[36]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[35]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[34]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[33]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[32]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[31]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[30]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[29]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[28]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[27]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[26]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[25]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[24]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[23]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[22]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[21]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[20]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[19]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[18]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[17]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[16]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[15]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[14]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[13]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {XDP[0]}]

set_property IOSTANDARD LVCMOS33 [get_ports {LED_OUT[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {LED_OUT[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {LED_OUT[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {LED_OUT[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_IN[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_IN[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_IN[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_IN[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_IN[0]}]

set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {TRG_OUT[0]}]
